Revit 2026 API

# KeynoteEntry Methods

---

The KeynoteEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from KeyBasedTreeEntry) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. (Inherited from KeyBasedTreeEntry) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

KeynoteEntry Class

Autodesk.Revit.DB Namespace